avr-rust/avrd/packs/atmega/ATmega1284RFR2.atdf
        <register caption="Timer/Counter Interrupt Flag Register" name="TIFR2" offset="0x37" size="1" ocd-rw="R">
          <bitfield caption="Reserved Bit" mask="0xF8" name="Res"/>
          <bitfield caption="Output Compare Flag 2 B" mask="0x04" name="OCF2B"/>
          <bitfield caption="Output Compare Flag 2 A" mask="0x02" name="OCF2A"/>
          <bitfield caption="Timer/Counter2 Overflow Flag" mask="0x01" name="TOV2"/>
        </register>
        <register caption="Timer/Counter2 Control Register A" name="TCCR2A" offset="0xB0" size="1">
          <bitfield caption="Compare Match Output A Mode" mask="0xC0" name="COM2A" values="TC2_COM2A_BITF"/>
          <bitfield caption="Compare Match Output B Mode" mask="0x30" name="COM2B" values="TC2_COM2B_BITF"/>
          <bitfield caption="Reserved" mask="0x0C" name="Res"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM2" values="TC0_WGM_BITF"/>
        </register>
        <register caption="Timer/Counter2 Control Register B" name="TCCR2B" offset="0xB1" size="1">
          <bitfield caption="Force Output Compare A" mask="0x80" name="FOC2A"/>
          <bitfield caption="Force Output Compare B" mask="0x40" name="FOC2B"/>
          <bitfield caption="Reserved" mask="0x30" name="Res"/>
          <bitfield caption="Waveform Generation Mode" mask="0x08" name="WGM22"/>
          <bitfield caption="Clock Select" mask="0x07" name="CS2" values="TC2_CLK_SEL_3BIT"/>
        </register>
        <register caption="Timer/Counter2" name="TCNT2" offset="0xB2" size="1" mask="0xFF"/>
        <register caption="Timer/Counter2 Output Compare Register B" name="OCR2B" offset="0xB4" size="1" mask="0xFF"/>
        <register caption="Timer/Counter2 Output Compare Register A" name="OCR2A" offset="0xB3" size="1" mask="0xFF"/>
        <register caption="Asynchronous Status Register" name="ASSR" offset="0xB6" size="1">
          <bitfield caption="Enable External Clock Input for AMR" mask="0x80" name="EXCLKAMR"/>
          <bitfield caption="Enable External Clock Input" mask="0x40" name="EXCLK"/>
          <bitfield caption="Timer/Counter2 Asynchronous Mode" mask="0x20" name="AS2"/>
          <bitfield caption="Timer/Counter2 Update Busy" mask="0x10" name="TCN2UB"/>
          <bitfield caption="Timer/Counter2 Output Compare Register A Update Busy" mask="0x08" name="OCR2AUB"/>
          <bitfield caption="Timer/Counter2 Output Compare Register B Update Busy" mask="0x04" name="OCR2BUB"/>
          <bitfield caption="Timer/Counter2 Control Register A Update Busy" mask="0x02" name="TCR2AUB"/>
          <bitfield caption="Timer/Counter2 Control Register B Update Busy" mask="0x01" name="TCR2BUB"/>
        </register>
        <register caption="General Timer Counter Control register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset Timer/Counter2" mask="0x02" name="PSRASY"/>
        </register>
      </register-group>
      <value-group caption="" name="TC2_COM2A_BITF">
        <value caption="Normal port operation, OC2A disconnected" name="VAL_0" value="0"/>
        <value caption="Toggle OC2A on Compare Match" name="VAL_1" value="1"/>
        <value caption="Clear OC2A on Compare Match" name="VAL_2" value="2"/>
        <value caption="Set OC2A on Compare Match" name="VAL_3" value="3"/>
      </value-group>
      <value-group caption="" name="TC2_COM2B_BITF">
        <value caption="Normal port operation, OC2B disconnected" name="VAL_0" value="0"/>
        <value caption="Toggle OC2B on Compare Match" name="VAL_1" value="1"/>
        <value caption="Clear OC2B on Compare Match" name="VAL_2" value="2"/>
        <value caption="Set OC2B on Compare Match" name="VAL_3" value="3"/>
      </value-group>
      <value-group caption="" name="TC0_WGM_BITF">
        <value caption="Normal mode of operation" name="VAL_0x0" value="0x0"/>
        <value caption="PWM, phase correct, TOP=0xFF" name="VAL_0x1" value="0x1"/>
        <value caption="CTC, TOP = OCRA" name="VAL_0x2" value="0x2"/>
        <value caption="Fast PWM, TOP=0xFF" name="VAL_0x3" value="0x3"/>
        <value caption="Reserved" name="VAL_0x4" value="0x4"/>
        <value caption="PWM, Phase correct, TOP = OCRA" name="VAL_0x5" value="0x5"/>
        <value caption="Reserved" name="VAL_0x6" value="0x6"/>
        <value caption="Fast PWM, TOP=OCRA" name="VAL_0x7" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC2_CLK_SEL_3BIT">
        <value caption="No clock source (Timer/Counter2 stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="clk_T2S/1 (no prescaling)" name="VAL_0x01" value="0x01"/>
        <value caption="clk_T2S/8 (from prescaler)" name="VAL_0x02" value="0x02"/>
        <value caption="clk_T2S/32 (from prescaler)" name="VAL_0x03" value="0x03"/>
        <value caption="clk_T2S/64 (from prescaler)" name="VAL_0x04" value="0x04"/>
        <value caption="clk_T2S/128 (from prescaler)" name="VAL_0x05" value="0x05"/>
        <value caption="clk_T2S/256 (from prescaler)" name="VAL_0x06" value="0x06"/>
        <value caption="clk_T2S/1024 (from prescaler)" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x60" size="1">
          <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS"/>
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
      </register-group>
      <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
        <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
        <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
        <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
        <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
        <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
        <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
        <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
        <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
        <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
        <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC5">
        <register caption="Timer/Counter5 Control Register A" name="TCCR5A" offset="0x120" size="1">
          <bitfield caption="Compare Output Mode for Channel A" mask="0xC0" name="COM5A" values="TC4_COMNX_BITF"/>
          <bitfield caption="Compare Output Mode for Channel B" mask="0x30" name="COM5B" values="TC4_COMNX_BITF"/>
          <bitfield caption="Compare Output Mode for Channel C" mask="0x0C" name="COM5C" values="TC4_COMNX_BITF"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM5" values="TC1_WGMX_BITF"/>
        </register>
