avr-rust/avrd/packs/atmega/ATmega1284RFR2.atdf
      <value-group caption="" name="RX_RPC_CTRL_BITF">
        <value caption="Activates minimum power saving behaviour for smart receiving mode" name="VAL_0" value="0"/>
        <value caption="Reserved" name="VAL_1" value="1"/>
        <value caption="Reserved" name="VAL_2" value="2"/>
        <value caption="Activates maximum power saving behaviour for smart receiving mode" name="VAL_3" value="3"/>
      </value-group>
      <value-group caption="" name="AACK_ACK_TIME_bitf">
        <value caption="12 symbols acknowledgment time" name="AACK_ACK_TIME_12_SYM" value="0"/>
        <value caption=" 2 symbols acknowledgment time" name="AACK_ACK_TIME_2_SYM" value="1"/>
      </value-group>
      <value-group caption="" name="PART_NUM_bitf">
        <value caption="ATmega128RFA1 part number" name="P_ATmega128RFA1" value="0x83"/>
        <value caption="RFA2 family" name="P_RFA2" value="0x93"/>
        <value caption="RFR2 family" name="P_RFR2" value="0x94"/>
      </value-group>
      <value-group caption="" name="VERSION_NUM_2_BITF">
        <value caption="Revision A" name="REV_A" value="12"/>
        <value caption="Revision B" name="REV_B" value="1"/>
        <value caption="Revision C" name="REV_C" value="3"/>
        <value caption="Revision D" name="REV_D" value="4"/>
      </value-group>
      <value-group caption="" name="MAN_ID_0_BITF">
        <value caption="Atmel JEDEC manufacturer ID, bits [7:0] of 32 bit manufacturer ID: 00 00 00 1F" name="ATMEL_BYTE_0" value="0x1f"/>
      </value-group>
      <value-group caption="" name="MAN_ID_1_BITF">
        <value caption="Atmel JEDEC manufacturer ID, bits [15:8] of 32 bit manufacturer ID: 00 00 00 1F" name="ATMEL_BYTE_1" value="0x00"/>
      </value-group>
      <value-group caption="" name="MAX_FRAME_RETRIES_bitf">
        <value caption="Retransmission of frame is not attempted." name="VAL_0x0" value="0x0"/>
        <value caption="Retransmission of frame is attempted once." name="VAL_0x1" value="0x1"/>
        <value caption="..." name="VAL_0x2" value="0x2"/>
        <value caption="Retransmission of frame is attempted 15 times." name="VAL_0xF" value="0xF"/>
      </value-group>
      <value-group caption="" name="MAX_CSMA_RETRIES_bitf">
        <value caption="No repetition of CSMA-CA procedure" name="VAL_0x0" value="0x0"/>
        <value caption="One repetition of CSMA-CA procedure" name="VAL_0x1" value="0x1"/>
        <value caption="..." name="VAL_0x2" value="0x2"/>
        <value caption="Five repetitions (highest IEEE 802.15.4 compliant value)" name="VAL_0x5" value="0x5"/>
        <value caption="Reserved" name="VAL_0x6" value="0x6"/>
        <value caption="Immediate frame re-transmission without performing CSMA-CA" name="VAL_0x7" value="0x7"/>
      </value-group>
      <value-group caption="" name="SLOTTED_OPERATION_BITF">
        <value caption="The radio transceiver operates in unslotted mode. An acknowledgment frame is automatically sent if requested." name="SLOTTED_OP_DIS" value="0"/>
        <value caption="The transmission of an acknowledgment frame has to be controlled by the microcontroller." name="SLOTTED_OP_EN" value="1"/>
      </value-group>
      <value-group caption="" name="AACK_FVN_MODE_bitf">
        <value caption="Acknowledge frames with version number 0" name="VAL_0" value="0"/>
        <value caption="Acknowledge frames with version number 0 or 1" name="VAL_1" value="1"/>
        <value caption="Acknowledge frames with version number 0 or 1 or 2" name="VAL_2" value="2"/>
        <value caption="Acknowledge frames independent of frame version number" name="VAL_3" value="3"/>
      </value-group>
      <value-group caption="" name="MAX_BE_bitf">
        <value caption="This value is not valid for the maximum back-off exponent." name="VAL_1" value="1"/>
        <value caption="This value is not valid for the maximum back-off exponent." name="VAL_2" value="2"/>
        <value caption="Minimum, IEEE compliant value for the maximum back-off exponent." name="VAL_3" value="3"/>
        <value caption="..." name="VAL_4" value="4"/>
        <value caption="Maximum, IEEE compliant value for the maximum back-off exponent." name="VAL_8" value="8"/>
      </value-group>
      <value-group caption="" name="MIN_BE_bitf">
        <value caption="Minimum value of minimum back-off exponent." name="VAL_0" value="0"/>
        <value caption="..." name="VAL_1" value="1"/>
        <value caption="Maximum value of minimum back-off exponent. MIN_BE must be smaller or equal to MAX_BE." name="VAL_8" value="8"/>
      </value-group>
      <value-group caption="" name="TST_CTRL_DIG_BITF">
        <value caption="NORMAL (no test is active)" name="VAL_0" value="0"/>
        <value caption="TST_CONT_TX (continuous transmit)" name="VAL_15" value="15"/>
      </value-group>
    </module>
    <module caption="MAC Symbol Counter" name="SYMCNT">
      <register-group caption="MAC Symbol Counter" name="SYMCNT">
        <register caption="Symbol Counter Transmit Frame Timestamp Register HH-Byte" name="SCTSTRHH" offset="0xFC" size="1">
          <bitfield caption="Symbol Counter Transmit Frame Timestamp Register HH-Byte" mask="0xFF" name="SCTSTRHH"/>
        </register>
        <register caption="Symbol Counter Transmit Frame Timestamp Register HL-Byte" name="SCTSTRHL" offset="0xFB" size="1">
          <bitfield caption="Symbol Counter Transmit Frame Timestamp Register HL-Byte" mask="0xFF" name="SCTSTRHL"/>
        </register>
        <register caption="Symbol Counter Transmit Frame Timestamp Register LH-Byte" name="SCTSTRLH" offset="0xFA" size="1">
          <bitfield caption="Symbol Counter Transmit Frame Timestamp Register LH-Byte" mask="0xFF" name="SCTSTRLH"/>
        </register>
        <register caption="Symbol Counter Transmit Frame Timestamp Register LL-Byte" name="SCTSTRLL" offset="0xF9" size="1">
          <bitfield caption="Symbol Counter Transmit Frame Timestamp Register LL-Byte" mask="0xFF" name="SCTSTRLL"/>
        </register>
        <register caption="Symbol Counter Output Compare Register 1 HH-Byte" name="SCOCR1HH" offset="0xF8" size="1">
          <bitfield caption="Symbol Counter Output Compare Register 1 HH-Byte" mask="0xFF" name="SCOCR1HH"/>
        </register>
